# Pandas

Pandas é uma biblioteca para gestão de dados, provendo funcionalidades para leitura de diversas estruturas de dados, bem como métodos para processamento e transformação dos mesmos. Além disso, provê gráficos para análise.

In [1]:
import numpy as np
import pandas as pd

## Série de dados

### Criando uma Série de dados

In [2]:
labels = ['a','b','c'] # lista de labels

lista = [10,20,30] # lista de valores

arr = np.array([10,20,30]) # array numpy

d = {'a':10,'b':20,'c':30} # dicionário de dados

#### Usando listas

In [3]:
pd.Series(data=lista)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=lista,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(lista,labels)

a    10
b    20
c    30
dtype: int64

#### Usando numpy array

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

#### Usando dicionários

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

A Série de dados pode ser de qualquer tipo de valores

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Trabalhando com indíces

In [10]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1['USA']

1

Quando se opera com Séries, importante relacionar os indíces. Perceba que os indíces abaixo não existentes nas duas séries possuem valores "NaN"

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Dataframe

In [16]:
from numpy.random import randn

In [17]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

In [19]:
df['W']

A   -1.423403
B    0.479722
C   -1.207823
D    0.340041
E    1.281731
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A -1.423403  0.680730
B  0.479722  1.272733
C -1.207823  0.019256
D  0.340041 -0.046511
E  1.281731  0.140763

In [21]:
df.W

A   -1.423403
B    0.479722
C   -1.207823
D    0.340041
E    1.281731
Name: W, dtype: float64

DataFrame Columns are just Series

In [22]:
type(df['W'])

pandas.core.series.Series

#### Criando uma nova coluna

In [23]:
df['nova'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z      nova
A -1.423403  0.290564 -0.513252  0.680730 -1.936654
B  0.479722  0.379853  0.565987  1.272733  1.045709
C -1.207823  2.362251  0.457831  0.019256 -0.749991
D  0.340041 -0.164532  1.165076 -0.046511  1.505117
E  1.281731 -1.420964 -1.234316  0.140763  0.047414

#### Removendo coluna

In [25]:
df.drop('nova',axis=1) # Observe o atributo "axis = 1"

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

In [26]:
# Perceba que ao imprimir o dataframe abaixo a coluna não foi removida de fato. 
df

          W         X         Y         Z      nova
A -1.423403  0.290564 -0.513252  0.680730 -1.936654
B  0.479722  0.379853  0.565987  1.272733  1.045709
C -1.207823  2.362251  0.457831  0.019256 -0.749991
D  0.340041 -0.164532  1.165076 -0.046511  1.505117
E  1.281731 -1.420964 -1.234316  0.140763  0.047414

In [27]:
# Apenas com o "inplace" é que, de fato, removemos a coluna do dataframe em questão. Mas e o que aconteceu na célula anterior?
df.drop('nova', axis=1, inplace=True)

In [28]:
df

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

Podemos então remover uma linha:

In [29]:
df.drop('E',axis=0) # Repare no valor do "axis = 0" novamente

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511

#### Selecionando linha

In [30]:
df.loc['A'] # Baseado no label

W   -1.423403
X    0.290564
Y   -0.513252
Z    0.680730
Name: A, dtype: float64

Ou então baseado em posição da linha:

In [31]:
df.iloc[2]

W   -1.207823
X    2.362251
Y    0.457831
Z    0.019256
Name: C, dtype: float64

#### Selecionando um subconjunto de linhas e colunas

In [32]:
df.loc['B','Y']

0.565987001265547

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.423403 -0.513252
B  0.479722  0.565987

### Seleção condicional

In [34]:
df

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

In [35]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True   True   True   True
C  False   True   True   True
D   True  False   True  False
E   True  False  False   True

In [36]:
df[df>0]

          W         X         Y         Z
A       NaN  0.290564       NaN  0.680730
B  0.479722  0.379853  0.565987  1.272733
C       NaN  2.362251  0.457831  0.019256
D  0.340041       NaN  1.165076       NaN
E  1.281731       NaN       NaN  0.140763

In [37]:
df[df['W']>0]

          W         X         Y         Z
B  0.479722  0.379853  0.565987  1.272733
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

In [38]:
df[df['W']>0]['Y']

B    0.565987
D    1.165076
E   -1.234316
Name: Y, dtype: float64

In [39]:
df[df['W']>0][['Y','X']]

          Y         X
B  0.565987  0.379853
D  1.165076 -0.164532
E -1.234316 -1.420964

Para mais de uma condição, podemos utilizar & (AND) e | (OR)

In [40]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
D  0.340041 -0.164532  1.165076 -0.046511

## Operações de indíce

In [41]:
df

          W         X         Y         Z
A -1.423403  0.290564 -0.513252  0.680730
B  0.479722  0.379853  0.565987  1.272733
C -1.207823  2.362251  0.457831  0.019256
D  0.340041 -0.164532  1.165076 -0.046511
E  1.281731 -1.420964 -1.234316  0.140763

In [42]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.423403  0.290564 -0.513252  0.680730
1     B  0.479722  0.379853  0.565987  1.272733
2     C -1.207823  2.362251  0.457831  0.019256
3     D  0.340041 -0.164532  1.165076 -0.046511
4     E  1.281731 -1.420964 -1.234316  0.140763

In [43]:
newind = 'CA NY WY OR CO'.split()

In [44]:
df['States'] = newind

In [45]:
df

          W         X         Y         Z States
A -1.423403  0.290564 -0.513252  0.680730     CA
B  0.479722  0.379853  0.565987  1.272733     NY
C -1.207823  2.362251  0.457831  0.019256     WY
D  0.340041 -0.164532  1.165076 -0.046511     OR
E  1.281731 -1.420964 -1.234316  0.140763     CO

In [46]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.423403  0.290564 -0.513252  0.680730
NY      0.479722  0.379853  0.565987  1.272733
WY     -1.207823  2.362251  0.457831  0.019256
OR      0.340041 -0.164532  1.165076 -0.046511
CO      1.281731 -1.420964 -1.234316  0.140763

In [47]:
df

          W         X         Y         Z States
A -1.423403  0.290564 -0.513252  0.680730     CA
B  0.479722  0.379853  0.565987  1.272733     NY
C -1.207823  2.362251  0.457831  0.019256     WY
D  0.340041 -0.164532  1.165076 -0.046511     OR
E  1.281731 -1.420964 -1.234316  0.140763     CO

In [48]:
df.set_index('States',inplace=True)

In [49]:
df

               W         X         Y         Z
States
CA     -1.423403  0.290564 -0.513252  0.680730
NY      0.479722  0.379853  0.565987  1.272733
WY     -1.207823  2.362251  0.457831  0.019256
OR      0.340041 -0.164532  1.165076 -0.046511
CO      1.281731 -1.420964 -1.234316  0.140763

# Groupby
Para quem conhece SQL, perceberá que funciona de maneira semelhante. Portanto, a ideia é agrupar valores semelhantes de maneira que se possa aplicar funções agregadoras.

In [50]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]} # Cria um dicionário

In [51]:
df = pd.DataFrame(data)

In [52]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

#### Agora vamos aplicar o groupby para identificar alguns valores sobre grupos

In [53]:
df.groupby('Company')

Perceba que ele retorna um objeto. Com ele poderemos aplicar as funções de agregação.

In [54]:
by_comp = df.groupby("Company")

Vamos obter a média por "Company"

In [55]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

O desvio padrão

In [57]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [58]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [59]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [60]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [61]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, Joining e Concatenação

In [62]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [63]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [65]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [67]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenação
Concatenar significa basicamente juntar os valores. Importante destacar que os dataframes precisam ter a mesma dimensão.

In [68]:
pd.concat([df1,df2,df3]) # concatenando em linha

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [69]:
pd.concat([df1,df2,df3],axis=1) # concatenando em coluna

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
Semelhante à função SQL, é possível unir as colunas baseadas em uma chave

In [2]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C3', 'C4'],
                          'D': ['D0', 'D1', 'D2', 'D3', 'D4']})

In [3]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [4]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K4  C4  D4

In [5]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joining
Semelhante ao Merge, une as colunas com base no critério. Contudo, a chave aqui é o indíce dos dataframes, sendo unificados mesmo quando os indíces não existem mutuamente.

In [74]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [75]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [76]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operações

In [8]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Valores únicos

In [78]:
df['col2'].unique()

array([444, 555, 666])

In [79]:
df['col2'].nunique()

3

In [80]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Aplicando funções

In [9]:
def times2(x):
    return x*2

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [84]:
df['col1'].sum()

10

#### Removendo coluna

In [85]:
del df['col1']

In [86]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Lista de colunas do dataframe

In [87]:
df.columns

Index(['col2', 'col3'], dtype='object')

#### Ordenando o dataframe

In [88]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [89]:
df.sort_values(by='col2') #inplace=False por padrão

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

#### Verificando valores nulos

In [90]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

#### Removendo valores NaN

In [91]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Preenchendo valores NaN

In [92]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [93]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [94]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [95]:
df.loc[0] = 1

In [96]:
df

     A    B  C  D
0    1    1  1  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Entrada e Saída de dados

## CSV

### CSV Input

In [99]:
df = pd.read_csv('../../data/automobile.txt')
df.head(2)

,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.60,...,130,mpfi,3.47,2.68,9.00,111,5000,21,27,13495
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
1,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500

### CSV Output

In [100]:
df.to_csv('../../data/test_automobile.txt',index=False)